In [1]:
# import the library
import pandas as pd

In [2]:
# Read the dataset
# give name to individual columns
df = pd.read_csv('titanic.txt', header=None,names=['class','age','gender','survived','Name1','Name2'])

In [3]:
df # display few rows

,class,age,gender,survived,Name1,Name2
0,1,29.00,F,1,Allen,Miss. Elisabeth Walton
1,1,0.92,M,1,Allison,Master. Hudson Trevor
2,1,2.00,F,0,Allison,Miss. Helen Loraine
3,1,30.00,M,0,Allison,Mr. Hudson Joshua Creighton
4,1,25.00,F,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...
1041,3,45.50,M,0,Youseff,Mr. Gerious
1042,3,14.50,F,0,Zabour,Miss. Hileni
1043,3,26.50,M,0,Zakarian,Mr. Mapriededer
1044,3,27.00,M,0,Zakarian,Mr. Ortin
1045,3,29.00,M,0,Zimmerman,Mr. Leo

# Q.1

- Algorithm:
- 1. Read the dataset using pandas read_csv() function which returns data as a dataframe 
- 2. filter the dataframe where class is 3
- 3. get the length using len() function

In [4]:
len(df[df['class']==3]) # Number of passengers took the 3rd cabin class.

501

# Q.2

- Algorithm:
- 1. Read the dataset using pandas read_csv() function which returns data as a dataframe 
- 2. filter the dataframe where gender is Male
- 3. get the length using len() function

In [5]:
len(df[df['gender']=='M']) # Number of Male passengers

658

- Algorithm:
- 1. Read the dataset using pandas read_csv() function which returns data as a dataframe
- 2. Filter the dataframe where gender is Male and survived = 1
- 3. Get the length

In [6]:
len(df[(df['gender']=='M') & (df['survived']==1)]) # Number of Male passengers survived

135

# Q.3

- Algorithm:
- 1. Read the dataset using pandas read_csv() function which returns data as a dataframe
- 2. filter the dataframe where gender is Female
- 3. get the length using len() function

In [7]:
len(df[df['gender']=='F']) #  Number of female passengers

388

- Algorithm:
- Read the dataset using pandas read_csv() function which returns data as a dataframe
- Filter the dataframe where gender is Female and survived = 1
- Get the length

In [8]:
len(df[(df['gender']=='F') & (df['survived']==1)]) # Number of female passengers survived

292

- All the above algorithms are universal and will work always

In [11]:
df[df.get('Name1')=='Allison']

,class,age,gender,survived,Name1,Name2
1,1,0.92,M,1,Allison,Master. Hudson Trevor
2,1,2.00,F,0,Allison,Miss. Helen Loraine
3,1,30.00,M,0,Allison,Mr. Hudson Joshua Creighton
4,1,25.00,F,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels)

In [45]:
def reformat_name(name2):
    return name2 + 'hel'

In [38]:
df[df.get('Name1')=='Allison'].get('Name2').apply(lambda x:len(x)).mean()

27.25

In [39]:
df[df.get('Name1')=='Allison'].get('Name2').apply(aa)

1                      Master. Hudson Trevorhel
2                        Miss. Helen Lorainehel
3                Mr. Hudson Joshua Creightonhel
4     Mrs. Hudson J C (Bessie Waldo Daniels)hel
Name: Name2, dtype: object

In [41]:
df[df.get('Name1')=='Allison'].get('Name2').apply(lambda x:len(aa(x))).mean()

30.25

In [54]:
def mean_values(country):
    return winter[winter.get("Country")==country].get('Athlete').apply(lambda x:len(reformat_name(x))).mean()

In [46]:
def mean_values(country):
    return df[df.get("Name1")==country].get('Name2').apply(lambda x:len(reformat_name(x))).mean()

In [ ]:
Allison

In [53]:
mean_values('Allison')

30.25

In [52]:
def mean_values(country):
    return df[df.get("Name1")==country].get('Name2').apply(lambda x:len(reformat_name(x))).mean()

In [ ]:
df[df.get('Name1')=='Allison'].get('Name2').apply(lambda x:len(aa(x))).mean()